app/controllers/application_controller.rb

SELECT "usuario".* FROM "usuario" WHERE "usuario"."id_usuario" IS NULL LIMIT 1
---
  def current_usuario
    # Busca o usuário no banco usando o ID salvo na sessão
    @current_usuario ||= Usuario.find_by(id_usuario: session[:usuario_id])