app/controllers/catalogo_controller.rb

SELECT "pescados".* FROM "pescados" WHERE "pescados"."disponivel" = TRUE
---
  def index
    @pescados = Pescado.where(disponivel: true)