app/controllers/pescados_controller.rb

SELECT "pescados".* FROM "pescados" WHERE "pescados"."disponivel" = TRUE
---
  def index
    @pescados = Pescado.where(disponivel: true)

SELECT "usuario".* FROM "usuario" ORDER BY "usuario"."id_usuario" ASC LIMIT 1
INSERT INTO "pescados" ("nome", "quantidade", "unidade", "preco_por_unidade", "descricao", "disponivel", "data_pesca", "id_usuario", "created_at", "updated_at") VALUES ('Camarão', 5.0, 'kg', 100.0, 'Camarão novo', TRUE, '2026-06-14', 1, '2026-06-14 20:03:36.601529', '2026-06-14 20:03:36.601529') RETURNING "id_pescado"
---
  def create
    @pescado = Pescado.new(pescado_params)

    # IMPORTANTE: Como ainda não temos login criado, vamos fingir que
    # o primeiro usuário do banco é o dono desse pescado temporariamente.
    @pescado.id_usuario = Usuario.first&.id_usuario || 1

    if @pescado.save