app/controllers/pescados_controller.rb

  def index
    @pescados = Pescado.all
---
SELECT "pescados".* FROM "pescados"