app/controllers/sessoes_controller.rb

  def create
    # Agora busca o usuário pelo LOGIN digitado
    usuario = Usuario.find_by(login: params[:login])
---
SELECT "usuario".* FROM "usuario" WHERE "usuario"."login" = 'marealta' LIMIT 1